Repository: kuprekat/LinuxApplicationDevelopment2022
Catalog: 12_Documenting/po/*.po
Languages: ru

source: Usage: ./num-game [OPTIONS]
ru: Запуск: ./num-game [ОПЦИИ]

source: Simple number game: program will guess the number from 1 to 100 that you guessed
ru: Простая численная игра: программа угадает число от 1 до 100, загаданное вами

source: Options:
ru: Опции:

source: -r print roman numbers instead arabic
ru: -r выводить римские цифры вместо арабских

source: -h, --help print help message
ru: -h, --help вывести вспомогательное сообщение

source: Constants:
ru: Константы:

source: char *romans array containing Roman numerals from 1 to 100
ru: char *romans массив, содержащий римские цифры от 1 до 100

source: Functions:
ru: Функции:

source: takes an integer from 1 to 100, returns a string with equal roman number or 'Err' on error
ru: принимает целое число от 1 до 100, возвращает строку с соответствующей римской цифрой или 'Err' в случае ошибки

source: takes a roman number from I to C, returns the equal value as an integer or -1 on error
ru: принимает римское число от I до C, возвращает соответствующее целое число или -1 в случае ошибки

source: num-game: invalid option '%s'
ru: num-game: неверный ключ '%s'

source: Try 'num-game --help' for more information.
ru: По команде «num-game --help» можно получить дополнительную информацию.

source: Guess a number from %s to %s:
ru: Загадайте число от %s до %s:

source: Is your number higher than %s?
ru: Ваше число больше %s?

source: yes
ru: да

source: no
ru: нет

source: Please, enter 'yes' or 'no'
ru: Пожалуйста, введите 'да' или 'нет'

source: Your number is %s
ru: Ваше число %s
